simulation/openfoam/tjunction_2d_serpentine/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// p_rgh = p - rho*g*h (pressure minus hydrostatic component)
// For microfluidic scales, hydrostatic pressure is negligible
// so p_rgh ≈ p

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oil_inlet
    {
        // 3 mm x 75 um resistor upstream: R ~ 4.1e9 Pa s/m^2 per unit depth,
        // so 13 kPa drives ~20 mm/s in the main channel (Ca = 0.032).
        type            totalPressure;
        p0              uniform 13000;
        value           uniform 13000;
    }

    water_inlet
    {
        // 4 mm x 30 um resistor: ~1.3 kPa across it at 10 mm/s, plus the
        // junction pressure (~0.7 kPa) and the ~0.8 kPa capillary entry
        // threshold. Sensitivity ~0.8 mm/s per 100 Pa; the resistor bounds
        // the breach surge to ~6 mm/s (unbounded without it).
        type            totalPressure;
        p0              uniform 3000;
        value           uniform 3000;
    }

    outlet
    {
        // Atmospheric pressure (gauge = 0)
        type            fixedValue;
        value           uniform 0;
    }

    walls
    {
        // Zero-flux for pressure at walls
        type            fixedFluxPressure;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
