simulation/openfoam/tjunction_2d_serpentine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-6;   // coordinates below are micrometres

vertices
(
    (-3000.0 37.5 0.0)   // 0
    (0.0 37.5 0.0)   // 1
    (0.0 112.5 0.0)   // 2
    (-3000.0 112.5 0.0)   // 3
    (-3000.0 37.5 80.0)   // 4
    (0.0 37.5 80.0)   // 5
    (0.0 112.5 80.0)   // 6
    (-3000.0 112.5 80.0)   // 7
    (0.0 0.0 0.0)   // 8
    (537.5 0.0 0.0)   // 9
    (537.5 37.5 0.0)   // 10
    (0.0 0.0 80.0)   // 11
    (537.5 0.0 80.0)   // 12
    (537.5 37.5 80.0)   // 13
    (537.5 112.5 0.0)   // 14
    (537.5 112.5 80.0)   // 15
    (537.5 150.0 0.0)   // 16
    (0.0 150.0 0.0)   // 17
    (537.5 150.0 80.0)   // 18
    (0.0 150.0 80.0)   // 19
    (560.0 0.0 0.0)   // 20
    (560.0 37.5 0.0)   // 21
    (560.0 0.0 80.0)   // 22
    (560.0 37.5 80.0)   // 23
    (560.0 112.5 0.0)   // 24
    (560.0 112.5 80.0)   // 25
    (560.0 150.0 0.0)   // 26
    (560.0 150.0 80.0)   // 27
    (590.0 0.0 0.0)   // 28
    (590.0 37.5 0.0)   // 29
    (590.0 0.0 80.0)   // 30
    (590.0 37.5 80.0)   // 31
    (590.0 112.5 0.0)   // 32
    (590.0 112.5 80.0)   // 33
    (590.0 150.0 0.0)   // 34
    (590.0 150.0 80.0)   // 35
    (612.5 0.0 0.0)   // 36
    (612.5 37.5 0.0)   // 37
    (612.5 0.0 80.0)   // 38
    (612.5 37.5 80.0)   // 39
    (612.5 112.5 0.0)   // 40
    (612.5 112.5 80.0)   // 41
    (612.5 150.0 0.0)   // 42
    (612.5 150.0 80.0)   // 43
    (1650.0 0.0 0.0)   // 44
    (1650.0 37.5 0.0)   // 45
    (1650.0 0.0 80.0)   // 46
    (1650.0 37.5 80.0)   // 47
    (1650.0 112.5 0.0)   // 48
    (1650.0 112.5 80.0)   // 49
    (1650.0 150.0 0.0)   // 50
    (1650.0 150.0 80.0)   // 51
    (560.0 450.0 0.0)   // 52
    (537.5 450.0 0.0)   // 53
    (560.0 450.0 80.0)   // 54
    (537.5 450.0 80.0)   // 55
    (590.0 450.0 0.0)   // 56
    (590.0 450.0 80.0)   // 57
    (612.5 450.0 0.0)   // 58
    (612.5 450.0 80.0)   // 59
    (590.0 4450.0 0.0)   // 60
    (560.0 4450.0 0.0)   // 61
    (590.0 4450.0 80.0)   // 62
    (560.0 4450.0 80.0)   // 63
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 1) simpleGrading (0.2 1 1)
    hex (8 9 10 1 11 12 13 5) (72 5 1) simpleGrading (1 1 1)
    hex (1 10 14 2 5 13 15 6) (72 10 1) simpleGrading (1 1 1)
    hex (2 14 16 17 6 15 18 19) (72 5 1) simpleGrading (1 1 1)
    hex (9 20 21 10 12 22 23 13) (3 5 1) simpleGrading (1 1 1)
    hex (10 21 24 14 13 23 25 15) (3 10 1) simpleGrading (1 1 1)
    hex (14 24 26 16 15 25 27 18) (3 5 1) simpleGrading (1 1 1)
    hex (20 28 29 21 22 30 31 23) (4 5 1) simpleGrading (1 1 1)
    hex (21 29 32 24 23 31 33 25) (4 10 1) simpleGrading (1 1 1)
    hex (24 32 34 26 25 33 35 27) (4 5 1) simpleGrading (1 1 1)
    hex (28 36 37 29 30 38 39 31) (3 5 1) simpleGrading (1 1 1)
    hex (29 37 40 32 31 39 41 33) (3 10 1) simpleGrading (1 1 1)
    hex (32 40 42 34 33 41 43 35) (3 5 1) simpleGrading (1 1 1)
    hex (36 44 45 37 38 46 47 39) (138 5 1) simpleGrading (1 1 1)
    hex (37 45 48 40 39 47 49 41) (138 10 1) simpleGrading (1 1 1)
    hex (40 48 50 42 41 49 51 43) (138 5 1) simpleGrading (1 1 1)
    hex (16 26 52 53 18 27 54 55) (3 40 1) simpleGrading (1 1 1)
    hex (26 34 56 52 27 35 57 54) (4 40 1) simpleGrading (1 1 1)
    hex (34 42 58 56 35 43 59 57) (3 40 1) simpleGrading (1 1 1)
    hex (52 56 60 61 54 57 62 63) (4 50 1) simpleGrading (1 8 1)
);

edges
(
);

boundary
(
    oil_inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    water_inlet
    {
        type patch;
        faces
        (
            (61 63 62 60)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (44 45 47 46)
            (45 48 49 47)
            (48 50 51 49)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (8 11 5 1)
            (8 9 12 11)
            (2 6 19 17)
            (17 19 18 16)
            (9 20 22 12)
            (20 28 30 22)
            (28 36 38 30)
            (36 44 46 38)
            (42 43 51 50)
            (16 18 55 53)
            (53 55 54 52)
            (42 58 59 43)
            (56 57 59 58)
            (52 54 63 61)
            (56 60 62 57)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (8 1 10 9)
            (11 12 13 5)
            (1 2 14 10)
            (5 13 15 6)
            (2 17 16 14)
            (6 15 18 19)
            (9 10 21 20)
            (12 22 23 13)
            (10 14 24 21)
            (13 23 25 15)
            (14 16 26 24)
            (15 25 27 18)
            (20 21 29 28)
            (22 30 31 23)
            (21 24 32 29)
            (23 31 33 25)
            (24 26 34 32)
            (25 33 35 27)
            (28 29 37 36)
            (30 38 39 31)
            (29 32 40 37)
            (31 39 41 33)
            (32 34 42 40)
            (33 41 43 35)
            (36 37 45 44)
            (38 46 47 39)
            (37 40 48 45)
            (39 47 49 41)
            (40 42 50 48)
            (41 49 51 43)
            (16 53 52 26)
            (18 27 54 55)
            (26 52 56 34)
            (27 35 57 54)
            (34 56 58 42)
            (35 43 59 57)
            (52 61 60 56)
            (54 57 62 63)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
