simulation/openfoam/tjunction_2d_serpentine/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Capillary-limited timesteps make serial runs slow (~250k steps for 0.12 s);
// 6-way decomposition keeps ~2k cells per rank on the 12.7k-cell 2D mesh.

numberOfSubdomains  6;

method              scotch;

// ************************************************************************* //
